In [1]:
import numpy as np
import pandas as pd
matrix = np.array([[2.7, 3.3, 3.4, 3.0, 3.1, 3.4, 3.0, 2.7],
                    [3.9, 2.8, 2.6, 4.0, 2.6, 3.0, 3.2, 3.0],
                    [2.5, 2.9, 3.4, 3.0, 3.2, 3.1, 3.2, 2.8]])

df = pd.DataFrame(matrix, columns=[f'Var{i+1}' for i in range(matrix.shape[1])])
print(df)#

   Var1  Var2  Var3  Var4  Var5  Var6  Var7  Var8
0   2.7   3.3   3.4   3.0   3.1   3.4   3.0   2.7
1   3.9   2.8   2.6   4.0   2.6   3.0   3.2   3.0
2   2.5   2.9   3.4   3.0   3.2   3.1   3.2   2.8

In [2]:
armazenado = df.drop(1)

In [3]:
armazenado

   Var1  Var2  Var3  Var4  Var5  Var6  Var7  Var8
0   2.7   3.3   3.4   3.0   3.1   3.4   3.0   2.7
2   2.5   2.9   3.4   3.0   3.2   3.1   3.2   2.8

In [4]:
df

   Var1  Var2  Var3  Var4  Var5  Var6  Var7  Var8
0   2.7   3.3   3.4   3.0   3.1   3.4   3.0   2.7
1   3.9   2.8   2.6   4.0   2.6   3.0   3.2   3.0
2   2.5   2.9   3.4   3.0   3.2   3.1   3.2   2.8

In [5]:
df.iloc[1]

Var1    3.9
Var2    2.8
Var3    2.6
Var4    4.0
Var5    2.6
Var6    3.0
Var7    3.2
Var8    3.0
Name: 1, dtype: float64

In [6]:
groupA = df.drop([0,2])
groupBC = df.iloc[[0, 2]]

In [7]:
groupA

   Var1  Var2  Var3  Var4  Var5  Var6  Var7  Var8
1   3.9   2.8   2.6   4.0   2.6   3.0   3.2   3.0

In [8]:
groupBC

   Var1  Var2  Var3  Var4  Var5  Var6  Var7  Var8
0   2.7   3.3   3.4   3.0   3.1   3.4   3.0   2.7
2   2.5   2.9   3.4   3.0   3.2   3.1   3.2   2.8

In [11]:
def dist(x, y):
    distance = np.linalg.norm(x - y)
    return distance

In [15]:
delta = 1/2
distancia = dist(groupA, groupBC)
print(distancia)

nan

In [21]:
df.iloc[1]

Var1    3.9
Var2    2.8
Var3    2.6
Var4    4.0
Var5    2.6
Var6    3.0
Var7    3.2
Var8    3.0
Name: 1, dtype: float64

In [36]:
from scipy.spatial.distance import pdist, squareform
matrix = np.array([[0, 0],
                    [1, 0],
                    [5, 5]]) matrix.iloc[1]

array([[0.        , 1.        , 7.07106781],
       [1.        , 0.        , 6.40312424],
       [7.07106781, 6.40312424, 0.        ]])

In [43]:
df = pd.DataFrame(matrix, columns=[f'Var{i+1}' for i in range(matrix.shape[1])])
dist(df.iloc[1], df.iloc[2])**2

np.float64(41.0)